<?php

use Illuminate\Support\Str;

return [

    /*
    |--------------------------------------------------------------------------
    | Default Cache Store
    |--------------------------------------------------------------------------
    |
    | Этот параметр определяет хранилище кеша по умолчанию, которое будет
    | использоваться фреймворком. Это соединение применяется, если при
    | выполнении операции с кешем внутри приложения не указано другое явно.
    |
    */

    'default' => env('CACHE_STORE', 'redis'),

    /*
    |--------------------------------------------------------------------------
    | Cache Stores
    |--------------------------------------------------------------------------
    |
    | Здесь вы можете определить все хранилища ("stores") кеша для вашего
    | приложения, а также их драйверы. Вы даже можете определить несколько
    | хранилищ с одним и тем же драйвером, чтобы группировать типы данных,
    | хранимых в кеше.
    |
    | Доступные драйверы: "array", "database", "file", "redis"
    |
    */

    'stores' => [

        'array' => [
            'driver' => 'array',
            'serialize' => false,
        ],

        'database' => [
            'driver' => 'database',
            'table' => env('DB_CACHE_TABLE', 'cache'),
            'connection' => env('DB_CACHE_CONNECTION'),
            'lock_connection' => env('DB_CACHE_LOCK_CONNECTION'),
        ],

        'file' => [
            'driver' => 'file',
            'path' => storage_path('framework/cache/data'),
            'lock_path' => storage_path('framework/cache/data'),
        ],

        'redis' => [
            'driver' => 'redis',
            'connection' => env('REDIS_CACHE_CONNECTION', 'cache'),
            'lock_connection' => env('REDIS_CACHE_LOCK_CONNECTION', 'default'),
        ],

    ],

    /*
    |--------------------------------------------------------------------------
    | Cache Key Prefix
    |--------------------------------------------------------------------------
    |
    | При использовании хранилищ кеша database и redis в той же среде может
    | работать несколько приложений, использующих один и тот же кеш. По этой
    | причине вы можете задать префикс для каждого ключа кеша, чтобы избежать
    | коллизий между приложениями.
    |
    */

    'prefix' => env('CACHE_PREFIX', Str::slug(env('APP_NAME', 'laravel'), '_').'_cache_'),

];